zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core0_COMMON.h
#define __MPU_PRESENT                  1         /**< Defines if an MPU is present or not */
#define __ICACHE_PRESENT               1         /**< Defines if an ICACHE is present or not */
#define __DCACHE_PRESENT               1         /**< Defines if an DCACHE is present or not */
#define __DTCM_PRESENT                 1         /**< Defines if an DTCM is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */

#include "core_cm7.h"                  /* Core Peripheral Access Layer */
#include "system_MCXE327_cm7_core0.h"  /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


#ifndef MCXE327_cm7_core0_SERIES
#define MCXE327_cm7_core0_SERIES
#endif
/* CPU specific feature definitions */
#include "MCXE327_cm7_core0_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections.
 * Refer to Reference Manual DMAMUX chapter for avaiable TCDs.
 */
typedef enum _dma_request_source
{
    kDmaRequestMux0Disabled         = 0U,          /**< Disabled */
    kDmaRequestMux1Disabled         = 0U,          /**< Disabled */
    kDmaRequestMux0SIUL2Req0        = 1U,          /**< SIUL2 DMA request 0 */
    kDmaRequestMux1SIUL2Req8        = 1U,          /**< SIUL2 DMA request 8 */
    kDmaRequestMux0SIUL2Req1        = 2U,          /**< SIUL2 DMA request 1 */
    kDmaRequestMux1SIUL2Req9        = 2U,          /**< SIUL2 DMA request 9 */
    kDmaRequestMux0SIUL2Req2        = 3U,          /**< SIUL2 DMA request 2 */
    kDmaRequestMux1SIUL2Req10       = 3U,          /**< SIUL2 DMA request 10 */
    kDmaRequestMux0SIUL2Req3        = 4U,          /**< SIUL2 DMA request 3 */
    kDmaRequestMux1SIUL2Req11       = 4U,          /**< SIUL2 DMA request 11 */
    kDmaRequestMux0SIUL2Req4        = 5U,          /**< SIUL2 DMA request 4 */
    kDmaRequestMux1SIUL2Req12       = 5U,          /**< SIUL2 DMA request 12 */
    kDmaRequestMux0SIUL2Req5        = 6U,          /**< SIUL2 DMA request 5 */
    kDmaRequestMux1SIUL2Req13       = 6U,          /**< SIUL2 DMA request 13 */
    kDmaRequestMux0SIUL2Req6        = 7U,          /**< SIUL2 DMA request 6 */
    kDmaRequestMux1SIUL2Req14       = 7U,          /**< SIUL2 DMA request 14 */
    kDmaRequestMux0SIUL2Req7        = 8U,          /**< SIUL2 DMA request 7 */
    kDmaRequestMux1SIUL2Req15       = 8U,          /**< SIUL2 DMA request 15 */
    kDmaRequestMux0BCTUFifo1        = 9U,          /**< BCTU DMA FIFO1 request */
    kDmaRequestMux1BCTUFifo2        = 9U,          /**< BCTU DMA FIFO2 request */
    kDmaRequestMux0BCTUReq0         = 10U,         /**< BCTU DMA request 0 */
    kDmaRequestMux1BCTUReq2         = 10U,         /**< BCTU DMA request 2 */
    kDmaRequestMux0BCTUReq1         = 11U,         /**< BCTU DMA request 1 */
    kDmaRequestMux1EMIOS0Req16      = 11U,         /**< EMIOS_0 DMA request 16 */
    kDmaRequestMux0EMIOS0Req0       = 12U,         /**< EMIOS_0 DMA request 0 */
    kDmaRequestMux1EMIOS0Req17      = 12U,         /**< EMIOS_0 DMA request 17 */
    kDmaRequestMux0EMIOS0Req1       = 13U,         /**< EMIOS_0 DMA request 1 */
    kDmaRequestMux1EMIOS0Req18      = 13U,         /**< EMIOS_0 DMA request 18 */
    kDmaRequestMux0EMIOS0Req9       = 14U,         /**< EMIOS_0 DMA request 9 */
    kDmaRequestMux1EMIOS0Req19      = 14U,         /**< EMIOS_0 DMA request 19 */
    kDmaRequestMux0EMIOS0Req10      = 15U,         /**< EMIOS_0 DMA request 10 */
    kDmaRequestMux1EMIOS1Req16      = 15U,         /**< EMIOS_1 DMA request 16 */
    kDmaRequestMux0EMIOS1Req0       = 16U,         /**< EMIOS_1 DMA request 0 */
    kDmaRequestMux1EMIOS1Req17      = 16U,         /**< EMIOS_1 DMA request 17 */
    kDmaRequestMux0EMIOS1Req1       = 17U,         /**< EMIOS_1 DMA request 1 */
    kDmaRequestMux1EMIOS1Req18      = 17U,         /**< EMIOS_1 DMA request 18 */
    kDmaRequestMux0EMIOS1Req9       = 18U,         /**< EMIOS_1 DMA request 9 */
    kDmaRequestMux1EMIOS1Req19      = 18U,         /**< EMIOS_1 DMA request 19 */
    kDmaRequestMux0EMIOS1Req10      = 19U,         /**< EMIOS_1 DMA request 10 */
    kDmaRequestMux0LCU0Req0         = 24U,         /**< LCU_0 DMA request 0 */
    kDmaRequestMux1LCU0Req2         = 24U,         /**< LCU_0 DMA request 2 */
    kDmaRequestMux0LCU1Req0         = 25U,         /**< LCU_1 DMA request 0 */
    kDmaRequestMux1LCU1Req1         = 25U,         /**< LCU_1 DMA request 1 */
    kDmaRequestMux0CAN0             = 29U,         /**< FLEXCAN_0 DMA request */
    kDmaRequestMux0CAN1             = 30U,         /**< FLEXCAN_1 DMA request */
    kDmaRequestMux0CAN2             = 31U,         /**< FLEXCAN_2 DMA request */
    kDmaRequestMux0CAN3             = 32U,         /**< FLEXCAN_3 DMA request */
    kDmaRequestMux0FLEXIOChannel0   = 33U,         /**< FlexIO Timer0 or Shifter0 DMA request */
    kDmaRequestMux0FLEXIOChannel1   = 34U,         /**< FlexIO Timer 1 or Shifter1 DMA request */
    kDmaRequestMux1FLEXIOChannel4   = 34U,         /**< FlexIO Timer4 or Shifter4 DMA request */
    kDmaRequestMux0FLEXIOChannel2   = 35U,         /**< FlexIO Timer 2 or Shifter2 DMA request */
    kDmaRequestMux1FLEXIOChannel5   = 35U,         /**< FlexIO Timer5 or Shifter5 DMA request */
    kDmaRequestMux0FLEXIOChannel3   = 36U,         /**< FlexIO Timer 3 or Shifter3 DMA request */
    kDmaRequestMux1FLEXIOChannel6   = 36U,         /**< FlexIO Timer6 or Shifter6 DMA request */
    kDmaRequestMux0LPUART0Tx        = 37U,         /**< LPUART_0 Transmit DMA request */
    kDmaRequestMux1FLEXIOChannel7   = 37U,         /**< FlexIO Timer7 or Shifter7 DMA request */
    kDmaRequestMux0LPUART0Rx        = 38U,         /**< LPUART_0 Receive DMA request */
    kDmaRequestMux1LPUART2Tx        = 38U,         /**< LPUART_2 Transmit DMA request */
    kDmaRequestMux0LPUART1Tx        = 39U,         /**< LPUART_1 Transmit DMA request */
    kDmaRequestMux1LPUART2Rx        = 39U,         /**< LPUART_2 Receive DMA request */
    kDmaRequestMux0LPUART1Rx        = 40U,         /**< LPUART_1 Receive DMA request */
    kDmaRequestMux1LPUART3Tx        = 40U,         /**< LPUART_3 Transmit DMA request */
    kDmaRequestMux0LPI2C0Rx         = 41U,         /**< LPI2C0 DMA RX or RX Slave request */
    kDmaRequestMux1LPUART3Rx        = 41U,         /**< LPUART_3 Receive DMA request */
    kDmaRequestMux0LPI2C0Tx         = 42U,         /**< LPI2C0 DMA TX or Tx Slave request */
    kDmaRequestMux0LPSPI0Tx         = 43U,         /**< LPSPI_0 DMA TX request */
    kDmaRequestMux0LPSPI0Rx         = 44U,         /**< LPSPI_0 DMA RX request */
    kDmaRequestMux0LPSPI1Tx         = 45U,         /**< LPSPI_1 DMA TX request */
    kDmaRequestMux0LPSPI1Rx         = 46U,         /**< LPSPI_1 DMA RX request */
    kDmaRequestMux0LPSPI2Tx         = 47U,         /**< LPSPI_2 DMA TX request */
    kDmaRequestMux0LPSPI2Rx         = 48U,         /**< LPSPI_2 DMA RX request */
    kDmaRequestMux0LPSPI3Tx         = 49U,         /**< LPSPI_3 DMA TX request */
    kDmaRequestMux0LPSPI3Rx         = 50U,         /**< LPSPI_3 DMA RX request */
    kDmaRequestMux1LPI2C1Rx         = 50U,         /**< LPI2C1 DMA RX or Slave RX request */
    kDmaRequestMux0QSPIRx           = 53U,         /**< QSPI RX Buffer Drain DMA request */
    kDmaRequestMux0QSPITx           = 54U,         /**< QSPI TX Buffer Fill DMA request */
    kDmaRequestMux0SAI0Rx           = 55U,         /**< SAI_0 DMA Receive request */
    kDmaRequestMux0SAI0Tx           = 56U,         /**< SAI_0 DMA Transmit request */
    kDmaRequestMux1SAI1Rx           = 56U,         /**< SAI_1 DMA Receive request */
    kDmaRequestMux0ADC0             = 58U,         /**< ADC_0 DMA request */
    kDmaRequestMux0ADC1             = 59U,         /**< ADC_1 DMA request */
    kDmaRequestMux0LPCMP0           = 61U,         /**< LPCMP_0 DMA COUT request */
    kDmaRequestMux0AlwaysOn62       = 62U,         /**<  Always On */
    kDmaRequestMux1AwaysOn62        = 62U,         /**<  Always On */
    kDmaRequestMux0AlwaysOn63       = 63U,         /**<  Always On */
    kDmaRequestMux1AwaysOn63        = 63U,         /**<  Always On */
    kDmaRequestMux1LCU0Req1         = 23U,         /**< LCU_0 DMA request 1 */
    kDmaRequestMux1LCU1Req2         = 26U,         /**< LCU_1 DMA request 2 */
    kDmaRequestMux1EMACPTPTimer     = 27U,         /**< EMAC IEEE 1588 PTP timer ch0-3 */
    kDmaRequestMux1LPI2C1Tx         = 51U,         /**< LPI2C1 DMA TX or Slave Tx request */
    kDmaRequestMux1SAI1Tx           = 57U,         /**< SAI_1 DMA Transmit request */
    kDmaRequestMux1LPCMP1           = 60U,         /**< LPCMP_1 DMA COUT request */
} dma_request_source_t;

/* @} */

/*!
 * @addtogroup trgmux_source
 * @{ */

