zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core0_COMMON.h
/* CMU_FM - Peripheral instance base addresses */
/** Peripheral CMU_1 base address */
#define CMU_1_BASE                               (0x402BC020u)
/** Peripheral CMU_1 base pointer */
#define CMU_1                                    ((CMU_FM_Type *)CMU_1_BASE)
/** Peripheral CMU_2 base address */
#define CMU_2_BASE                               (0x402BC040u)
/** Peripheral CMU_2 base pointer */
#define CMU_2                                    ((CMU_FM_Type *)CMU_2_BASE)
/** Array initializer of CMU_FM peripheral base addresses */
#define CMU_FM_BASE_ADDRS                        { CMU_1_BASE, CMU_2_BASE }
/** Array initializer of CMU_FM peripheral base pointers */
#define CMU_FM_BASE_PTRS                         { CMU_1, CMU_2 }

/* CONFIGURATION - Peripheral instance base addresses */
/** Peripheral CONFIGURATION base address */
#define CONFIGURATION_BASE                       (0x4039C000u)
/** Peripheral CONFIGURATION base pointer */
#define CONFIGURATION                            ((CONFIGURATION_Type *)CONFIGURATION_BASE)
/** Array initializer of CONFIGURATION peripheral base addresses */
#define CONFIGURATION_BASE_ADDRS                 { CONFIGURATION_BASE }
/** Array initializer of CONFIGURATION peripheral base pointers */
#define CONFIGURATION_BASE_PTRS                  { CONFIGURATION }

/* CRC - Peripheral instance base addresses */
/** Peripheral CRC base address */
#define CRC_BASE                                 (0x40380000u)
/** Peripheral CRC base pointer */
#define CRC                                      ((CRC_Type *)CRC_BASE)
/** Array initializer of CRC peripheral base addresses */
#define CRC_BASE_ADDRS                           { CRC_BASE }
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASE_PTRS                            { CRC }

/* DCM - Peripheral instance base addresses */
/** Peripheral DCM base address */
#define DCM_BASE                                 (0x402AC000u)
/** Peripheral DCM base pointer */
#define DCM                                      ((DCM_Type *)DCM_BASE)
/** Array initializer of DCM peripheral base addresses */
#define DCM_BASE_ADDRS                           { DCM_BASE }
/** Array initializer of DCM peripheral base pointers */
#define DCM_BASE_PTRS                            { DCM }

/* DCM_GPR - Peripheral instance base addresses */
/** Peripheral DCM_GPR base address */
#define DCM_GPR_BASE                             (0x402AC000u)
/** Peripheral DCM_GPR base pointer */
#define DCM_GPR                                  ((DCM_GPR_Type *)DCM_GPR_BASE)
/** Array initializer of DCM_GPR peripheral base addresses */
#define DCM_GPR_BASE_ADDRS                       { DCM_GPR_BASE }
/** Array initializer of DCM_GPR peripheral base pointers */
#define DCM_GPR_BASE_PTRS                        { DCM_GPR }

/* DMA - Peripheral instance base addresses */
/** Peripheral EDMA base address */
#define EDMA_BASE                                (0x4020C000u)
/** Peripheral EDMA base pointer */
#define EDMA                                     ((DMA_Type *)EDMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { EDMA_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { EDMA }
/** Interrupt vectors for the DMA peripheral type */
#define DMA_IRQS                                 { { DMATCD0_IRQn, DMATCD1_IRQn, DMATCD2_IRQn, DMATCD3_IRQn, DMATCD4_IRQn, DMATCD5_IRQn, DMATCD6_IRQn, DMATCD7_IRQn, DMATCD8_IRQn, DMATCD9_IRQn, DMATCD10_IRQn, DMATCD11_IRQn, DMATCD12_IRQn, DMATCD13_IRQn, DMATCD14_IRQn, DMATCD15_IRQn, DMATCD16_IRQn, DMATCD17_IRQn, DMATCD18_IRQn, DMATCD19_IRQn, DMATCD20_IRQn, DMATCD21_IRQn, DMATCD22_IRQn, DMATCD23_IRQn, DMATCD24_IRQn, DMATCD25_IRQn, DMATCD26_IRQn, DMATCD27_IRQn, DMATCD28_IRQn, DMATCD29_IRQn, DMATCD30_IRQn, DMATCD31_IRQn } }

/* DMAMUX - Peripheral instance base addresses */
/** Peripheral DMAMUX_0 base address */
#define DMAMUX_0_BASE                            (0x40280000u)
/** Peripheral DMAMUX_0 base pointer */
#define DMAMUX_0                                 ((DMAMUX_Type *)DMAMUX_0_BASE)
/** Peripheral DMAMUX_1 base address */
#define DMAMUX_1_BASE                            (0x40284000u)
/** Peripheral DMAMUX_1 base pointer */
#define DMAMUX_1                                 ((DMAMUX_Type *)DMAMUX_1_BASE)
/** Array initializer of DMAMUX peripheral base addresses */
#define DMAMUX_BASE_ADDRS                        { DMAMUX_0_BASE, DMAMUX_1_BASE }
/** Array initializer of DMAMUX peripheral base pointers */
#define DMAMUX_BASE_PTRS                         { DMAMUX_0, DMAMUX_1 }

/* EIM - Peripheral instance base addresses */
/** Peripheral EIM base address */
#define EIM_BASE                                 (0x40258000u)
/** Peripheral EIM base pointer */
#define EIM                                      ((EIM_Type *)EIM_BASE)
/** Array initializer of EIM peripheral base addresses */
#define EIM_BASE_ADDRS                           { EIM_BASE }
/** Array initializer of EIM peripheral base pointers */
#define EIM_BASE_PTRS                            { EIM }

/* EMAC - Peripheral instance base addresses */
/** Peripheral EMAC base address */
#define EMAC_BASE                                (0x40480000u)
/** Peripheral EMAC base pointer */
#define EMAC                                     ((EMAC_Type *)EMAC_BASE)
/** Array initializer of EMAC peripheral base addresses */
#define EMAC_BASE_ADDRS                          { EMAC_BASE }
/** Array initializer of EMAC peripheral base pointers */
#define EMAC_BASE_PTRS                           { EMAC }
/** Interrupt vectors for the EMAC peripheral type */
#define EMAC_IRQS                                { EMAC_0_IRQn }

/* EMIOS - Peripheral instance base addresses */
/** Peripheral EMIOS_0 base address */
#define EMIOS_0_BASE                             (0x40088000u)
/** Peripheral EMIOS_0 base pointer */
#define EMIOS_0                                  ((EMIOS_Type *)EMIOS_0_BASE)
/** Peripheral EMIOS_1 base address */
#define EMIOS_1_BASE                             (0x4008C000u)
/** Peripheral EMIOS_1 base pointer */
#define EMIOS_1                                  ((EMIOS_Type *)EMIOS_1_BASE)
/** Array initializer of EMIOS peripheral base addresses */
#define EMIOS_BASE_ADDRS                         { EMIOS_0_BASE, EMIOS_1_BASE }
/** Array initializer of EMIOS peripheral base pointers */
#define EMIOS_BASE_PTRS                          { EMIOS_0, EMIOS_1 }

/* ERM - Peripheral instance base addresses */
/** Peripheral ERM base address */
#define ERM_BASE                                 (0x4025C000u)
/** Peripheral ERM base pointer */
#define ERM                                      ((ERM_Type *)ERM_BASE)
/** Array initializer of ERM peripheral base addresses */
#define ERM_BASE_ADDRS                           { ERM_BASE }
/** Array initializer of ERM peripheral base pointers */
#define ERM_BASE_PTRS                            { ERM }

